12/data/attachments/256115c73a4f06a1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Shane_trip_Friend_18089_6</nif:username>
            <nif:friendToBeRequested>soap_friends_d687860b-2364-4b89-af16-4ccb3a34a4c6</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>